---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroManager.IsEnabled
source: html/08e6559b-28e7-330d-44be-bfd53a69e239.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.IsEnabled Property

Indicates if macros stored in this MacroManager are enabled.

## Syntax (C#)
```csharp
public bool IsEnabled { get; }
```